Revit 2026 API

# FloorCreate(Document, IListCurveLoop, ElementId, ElementId, Boolean, Line, Double) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Floor Create(
	Document document,
	IList<CurveLoop> profile,
	ElementId floorTypeId,
	ElementId levelId,
	bool isStructural,
	Line slopeArrow,
	double slope
)
```
```vb
Public Shared Function Create (
	document As Document,
	profile As IList(Of CurveLoop),
	floorTypeId As ElementId,
	levelId As ElementId,
	isStructural As Boolean,
	slopeArrow As Line,
	slope As Double
) As Floor
```
```cpp
public:
static Floor^ Create(
	Document^ document,
	IList<CurveLoop^>^ profile,
	ElementId^ floorTypeId,
	ElementId^ levelId,
	bool isStructural,
	Line^ slopeArrow,
	double slope
)
```
```fsharp
static member Create :
        document : Document *
        profile : IList<CurveLoop> *
        floorTypeId : ElementId *
        levelId : ElementId *
        isStructural : bool *
        slopeArrow : Line *
        slope : float -> Floor
```

#### Parameters

document Document

profile IListCurveLoop

floorTypeId ElementId

levelId ElementId

isStructural Boolean

slopeArrow Line

slope Double

#### Return Value

Floor

#### Reference

Floor Class

Create Overload

Autodesk.Revit.DB Namespace